<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Objectives" data-toc-modified-id="Objectives-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Objectives</a></span></li><li><span><a href="#One-to-Many-and-Many-to-Many-Joins" data-toc-modified-id="One-to-Many-and-Many-to-Many-Joins-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>One-to-Many and Many-to-Many Joins</a></span></li><li><span><a href="#Employees-and-their-Office-(a-One-to-One-join)" data-toc-modified-id="Employees-and-their-Office-(a-One-to-One-join)-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Employees and their Office (a One-to-One join)</a></span></li><li><span><a href="#Customers-and-their-Orders-(a-One-to-Many-join)" data-toc-modified-id="Customers-and-their-Orders-(a-One-to-Many-join)-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Customers and their Orders (a One-to-Many join)</a></span></li><li><span><a href="#Orders-and-their-Order-Details-(another-One-to-Many-join)" data-toc-modified-id="Orders-and-their-Order-Details-(another-One-to-Many-join)-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Orders and their Order Details (another One-to-Many join)</a></span></li><li><span><a href="#Orders,-Order-details-and-Product-Details-(a-Many-to-Many-Join)" data-toc-modified-id="Orders,-Order-details-and-Product-Details-(a-Many-to-Many-Join)-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Orders, Order details and Product Details (a Many-to-Many Join)</a></span></li><li><span><a href="#Summary" data-toc-modified-id="Summary-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Summary</a></span></li></ul></div>

# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [9]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

cur.execute('''select officeCode, firstName, lastName, city, state  from employees join offices using(officeCode)
            ORDER by firstName;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 23

  officeCode firstName lastName           city state
0          6      Andy   Fixter         Sydney
1          1   Anthony      Bow  San Francisco    CA
2          7     Barry    Jones         London
3          1     Diane   Murphy  San Francisco    CA
4          3  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [12]:
# Your code here
cur.execute('''select customerName, orderNumber, orderDate, status from customers join orders using(customerNumber);''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 326

         customerName orderNumber   orderDate   status
0   Atelier graphique       10123  2003-05-20  Shipped
1   Atelier graphique       10298  2004-09-27  Shipped
2   Atelier graphique       10345  2004-11-25  Shipped
3  Signal Gift Stores       10124  2003-05-21  Shipped
4  Signal Gift Stores       10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [14]:
# Your code here
cur.execute('''select orderNumber, orderdetails.* from orders join orderdetails using(orderNumber);''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 2996

,orderNumber,orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber
0,10100,10100,S18_1749,30,136.00,3
1,10100,10100,S18_2248,50,55.09,2
2,10100,10100,S18_4409,22,75.46,4
3,10100,10100,S24_3969,49,35.29,1
4,10101,10101,S18_2325,25,108.06,4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [24]:
# Your code here
cur.execute('''SELECT * FROM orderdetails 
            join orders using (orderNumber)
            join products using (productCode);''')


df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 2996

,orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,10100,S18_1749,30,136.00,3,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,1917 Grand Touring Sedan,Vintage Cars,1:18,Welly Diecast Productions,This 1:18 scale replica of the 1917 Grand Tour...,2724,86.70,170.00
1,10100,S18_2248,50,55.09,2,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,1911 Ford Town Car,Vintage Cars,1:18,Motor City Art Classics,"Features opening hood, opening doors, opening ...",540,33.30,60.54
2,10100,S18_4409,22,75.46,4,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,1932 Alfa Romeo 8C2300 Spider Sport,Vintage Cars,1:18,Exoto Designs,This 1:18 scale precision die cast replica fea...,6553,43.26,92.03
3,10100,S24_3969,49,35.29,1,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,1936 Mercedes Benz 500k Roadster,Vintage Cars,1:24,Red Start Diecast,This model features grille-mounted chrome horn...,2081,21.75,41.03
4,10101,S18_2325,25,108.06,4,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,1932 Model A Ford J-Coupe,Vintage Cars,1:18,Autoart Studio Design,This model features grille-mounted chrome horn...,9354,58.48,127.13

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!